MCUdude/MightyCore/avr/boards.txt
324.name=ATmega324
324.upload.tool=avrdude
324.upload.protocol=arduino
324.upload.maximum_size=32256
324.upload.maximum_data_size=2048

324.bootloader.tool=arduino:avrdude
324.bootloader.unlock_bits=0x3f
324.bootloader.lock_bits=0x0f

324.build.core=MightyCore
324.build.board=AVR_ATmega324

324.menu.pinout.standard=Standard
324.menu.pinout.standard.build.variant=standard
324.menu.pinout.bobuino=Bobuino
324.menu.pinout.bobuino.build.variant=bobuino

324.menu.variant.modelP=324P
324.menu.variant.modelP.build.mcu=atmega324p
324.menu.variant.modelPA=324PA
324.menu.variant.modelPA.build.mcu=atmega324pa
324.menu.variant.modelA=324A
324.menu.variant.modelA.build.mcu=atmega324a

324.menu.BOD.2v7=2.7v
324.menu.BOD.2v7.bootloader.extended_fuses=0xfd
324.menu.BOD.4v3=4.3v
324.menu.BOD.4v3.bootloader.extended_fuses=0xfc
324.menu.BOD.1v8=1.8v
324.menu.BOD.1v8.bootloader.extended_fuses=0xfe
324.menu.BOD.disabled=Disabled
324.menu.BOD.disabled.bootloader.extended_fuses=0xff


#make atmega324 AVR_FREQ=16000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
324.menu.clock.16MHz_external=16MHz external
324.menu.clock.16MHz_external.upload.speed=115200
324.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
324.menu.clock.16MHz_external.bootloader.high_fuses=0xde
324.menu.clock.16MHz_external.bootloader.file=optiboot_flash/atmega324/optiboot_flash_atmega324p_115200_16MHz.hex
324.menu.clock.16MHz_external.build.f_cpu=16000000L

#make atmega324 AVR_FREQ=20000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
324.menu.clock.20MHz_external=20MHz external
324.menu.clock.20MHz_external.upload.speed=115200
324.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
324.menu.clock.20MHz_external.bootloader.high_fuses=0xde
324.menu.clock.20MHz_external.bootloader.file=optiboot_flash/atmega324/optiboot_flash_atmega324p_115200_20MHz.hex
324.menu.clock.20MHz_external.build.f_cpu=20000000L

#make atmega324 AVR_FREQ=8000000L BAUD_RATE=57600 UART=0 LED=B0 LED_START_FLASHES=2
324.menu.clock.8MHz_external=8MHz external
324.menu.clock.8MHz_external.upload.speed=57600
324.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
324.menu.clock.8MHz_external.bootloader.high_fuses=0xde
324.menu.clock.8MHz_external.bootloader.file=optiboot_flash/atmega324/optiboot_flash_atmega324p_57600_8MHz.hex
324.menu.clock.8MHz_external.build.f_cpu=8000000L

#make atmega324 AVR_FREQ=8000000L BAUD_RATE=38400 UART=0 LED=B0 LED_START_FLASHES=2
324.menu.clock.8MHz_internal=8MHz internal
324.menu.clock.8MHz_internal.upload.speed=38400
324.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
324.menu.clock.8MHz_internal.bootloader.high_fuses=0xde
324.menu.clock.8MHz_internal.bootloader.file=optiboot_flash/atmega324/optiboot_flash_atmega324p_38400_8MHz.hex
324.menu.clock.8MHz_internal.build.f_cpu=8000000L

#make atmega324 AVR_FREQ=1000000L BAUD_RATE=9600 UART=0 LED=B0 LED_START_FLASHES=2
324.menu.clock.1MHz_internal=1MHz internal
324.menu.clock.1MHz_internal.upload.speed=9600
324.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
324.menu.clock.1MHz_internal.bootloader.high_fuses=0xde
324.menu.clock.1MHz_internal.bootloader.file=optiboot_flash/atmega324/optiboot_flash_atmega324p_9600_1MHz.hex
324.menu.clock.1MHz_internal.build.f_cpu=1000000L


############################################################


164.name=ATmega164
164.upload.tool=avrdude
164.upload.protocol=arduino
164.upload.maximum_size=15872
164.upload.maximum_data_size=1024

164.bootloader.tool=arduino:avrdude
164.bootloader.unlock_bits=0x3f
164.bootloader.lock_bits=0x0f

164.build.core=MightyCore
164.build.board=AVR_ATmega164

164.menu.pinout.standard=Standard
164.menu.pinout.standard.build.variant=standard
164.menu.pinout.bobuino=Bobuino
164.menu.pinout.bobuino.build.variant=bobuino

164.menu.variant.modelP=164P / 164PA
164.menu.variant.modelP.build.mcu=atmega164p
164.menu.variant.modelA=164A
164.menu.variant.modelA.build.mcu=atmega164a

164.menu.BOD.2v7=2.7v
164.menu.BOD.2v7.bootloader.extended_fuses=0xfd
164.menu.BOD.4v3=4.3v
164.menu.BOD.4v3.bootloader.extended_fuses=0xfc
164.menu.BOD.1v8=1.8v
164.menu.BOD.1v8.bootloader.extended_fuses=0xfe
164.menu.BOD.disabled=Disabled
164.menu.BOD.disabled.bootloader.extended_fuses=0xff


#make atmega164 AVR_FREQ=16000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
164.menu.clock.16MHz_external=16MHz external
164.menu.clock.16MHz_external.upload.speed=115200
164.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.16MHz_external.bootloader.high_fuses=0xdc
164.menu.clock.16MHz_external.bootloader.file=optiboot_flash/atmega164/optiboot_flash_atmega164p_115200_16MHz.hex
164.menu.clock.16MHz_external.build.f_cpu=16000000L

#make atmega164 AVR_FREQ=20000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
164.menu.clock.20MHz_external=20MHz external
164.menu.clock.20MHz_external.upload.speed=115200
164.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.20MHz_external.bootloader.high_fuses=0xdc
164.menu.clock.20MHz_external.bootloader.file=optiboot_flash/atmega164/optiboot_flash_atmega164p_115200_20MHz.hex
164.menu.clock.20MHz_external.build.f_cpu=20000000L

#make atmega164 AVR_FREQ=8000000L BAUD_RATE=57600 UART=0 LED=B0 LED_START_FLASHES=2
164.menu.clock.8MHz_external=8MHz external
164.menu.clock.8MHz_external.upload.speed=57600
164.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
164.menu.clock.8MHz_external.bootloader.high_fuses=0xdc
164.menu.clock.8MHz_external.bootloader.file=optiboot_flash/atmega164/optiboot_flash_atmega164p_57600_8MHz.hex
164.menu.clock.8MHz_external.build.f_cpu=8000000L

#make atmega164 AVR_FREQ=8000000L BAUD_RATE=38400 UART=0 LED=B0 LED_START_FLASHES=2
164.menu.clock.8MHz_internal=8MHz internal
164.menu.clock.8MHz_internal.upload.speed=38400
164.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
164.menu.clock.8MHz_internal.bootloader.high_fuses=0xdc
164.menu.clock.8MHz_internal.bootloader.file=optiboot_flash/atmega164/optiboot_flash_atmega164p_38400_8MHz.hex
164.menu.clock.8MHz_internal.build.f_cpu=8000000L

#make atmega164 AVR_FREQ=1000000L BAUD_RATE=9600 UART=0 LED=B0 LED_START_FLASHES=2
164.menu.clock.1MHz_internal=1MHz internal
164.menu.clock.1MHz_internal.upload.speed=9600
164.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
164.menu.clock.1MHz_internal.bootloader.high_fuses=0xdc
164.menu.clock.1MHz_internal.bootloader.file=optiboot_flash/atmega164/optiboot_flash_atmega164p_9600_1MHz.hex
164.menu.clock.1MHz_internal.build.f_cpu=1000000L


############################################################


