MCUdude/MightyCore/avr/boards.txt
32.name=ATmega32
32.upload.tool=avrdude
32.upload.protocol=arduino
32.upload.maximum_size=32256
32.upload.maximum_data_size=2048

32.bootloader.tool=avrdudeCustom
32.bootloader.unlock_bits=0x3f
32.bootloader.lock_bits=0x0f

32.build.mcu=atmega32
32.build.core=MightyCore
32.build.board=AVR_ATmega32

32.menu.pinout.standard=Standard
32.menu.pinout.standard.build.variant=standard
32.menu.pinout.bobuino=Bobuino
32.menu.pinout.bobuino.build.variant=bobuino

#make atmega32 AVR_FREQ=16000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
32.menu.clock.16MHz_external=16MHz external (BOD 2.7v)
32.menu.clock.16MHz_external.upload.speed=115200
32.menu.clock.16MHz_external.bootloader.low_fuses=0xbf
32.menu.clock.16MHz_external.bootloader.high_fuses=0xde
32.menu.clock.16MHz_external.bootloader.file=optiboot_flash/atmega32/optiboot_flash_atmega32_115200_16MHz.hex
32.menu.clock.16MHz_external.build.f_cpu=16000000L

#make atmega32 AVR_FREQ=20000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
32.menu.clock.20MHz_external=20MHz external (BOD 4.0v)
32.menu.clock.20MHz_external.upload.speed=115200
32.menu.clock.20MHz_external.bootloader.low_fuses=0x3f
32.menu.clock.20MHz_external.bootloader.high_fuses=0xde
32.menu.clock.20MHz_external.bootloader.file=optiboot_flash/atmega32/optiboot_flash_atmega32_115200_20MHz.hex
32.menu.clock.20MHz_external.build.f_cpu=20000000L

#make atmega32 AVR_FREQ=8000000L BAUD_RATE=57600 UART=0 LED=B0 LED_START_FLASHES=2
32.menu.clock.8MHz_external=8MHz external  (BOD 2.7v)
32.menu.clock.8MHz_external.upload.speed=57600
32.menu.clock.8MHz_external.bootloader.low_fuses=0xbf
32.menu.clock.8MHz_external.bootloader.high_fuses=0xde
32.menu.clock.8MHz_external.bootloader.file=optiboot_flash/atmega32/optiboot_flash_atmega32_57600_8MHz.hex
32.menu.clock.8MHz_external.build.f_cpu=8000000L

#make atmega32 AVR_FREQ=8000000L BAUD_RATE=38400 UART=0 LED=B0 LED_START_FLASHES=2
32.menu.clock.8MHz_internal=8MHz internal   (BOD 2.7v)
32.menu.clock.8MHz_internal.upload.speed=38400
32.menu.clock.8MHz_internal.bootloader.low_fuses=0xa4
32.menu.clock.8MHz_internal.bootloader.high_fuses=0xde
32.menu.clock.8MHz_internal.bootloader.file=optiboot_flash/atmega32/optiboot_flash_atmega32_38400_8MHz.hex
32.menu.clock.8MHz_internal.build.f_cpu=8000000L

#make atmega32 AVR_FREQ=1000000L BAUD_RATE=9600 UART=0 LED=B0 LED_START_FLASHES=2
32.menu.clock.1MHz_internal=1MHz internal   (BOD 2.7v)
32.menu.clock.1MHz_internal.upload.speed=9600
32.menu.clock.1MHz_internal.bootloader.low_fuses=0xa1
32.menu.clock.1MHz_internal.bootloader.high_fuses=0xde
32.menu.clock.1MHz_internal.bootloader.file=optiboot_flash/atmega32/optiboot_flash_atmega32_9600_1MHz.hex
32.menu.clock.1MHz_internal.build.f_cpu=1000000L


############################################################


16.name=ATmega16
16.upload.tool=avrdude
16.upload.protocol=arduino
16.upload.maximum_size=15872
16.upload.maximum_data_size=1024

16.bootloader.tool=avrdudeCustom
16.bootloader.unlock_bits=0x3f
16.bootloader.lock_bits=0x0f

16.build.mcu=atmega16
16.build.core=MightyCore
16.build.board=AVR_ATmega16

16.menu.pinout.standard=Standard
16.menu.pinout.standard.build.variant=standard
16.menu.pinout.bobuino=Bobuino
16.menu.pinout.bobuino.build.variant=bobuino

#make atmega16 AVR_FREQ=16000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
16.menu.clock.16MHz_external=16MHz external (BOD 2.7v)
16.menu.clock.16MHz_external.upload.speed=115200
16.menu.clock.16MHz_external.bootloader.low_fuses=0xbf
16.menu.clock.16MHz_external.bootloader.high_fuses=0xdc
16.menu.clock.16MHz_external.bootloader.file=optiboot_flash/atmega16/optiboot_flash_atmega16_115200_16MHz.hex
16.menu.clock.16MHz_external.build.f_cpu=16000000L

#make atmega16 AVR_FREQ=20000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
16.menu.clock.20MHz_external=20MHz external (BOD 4.0v)
16.menu.clock.20MHz_external.upload.speed=115200
16.menu.clock.20MHz_external.bootloader.low_fuses=0x3f
16.menu.clock.20MHz_external.bootloader.high_fuses=0xdc
16.menu.clock.20MHz_external.bootloader.file=optiboot_flash/atmega16/optiboot_flash_atmega16_115200_20MHz.hex
16.menu.clock.20MHz_external.build.f_cpu=20000000L

#make atmega16 AVR_FREQ=8000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
16.menu.clock.8MHz_external=8MHz external   (BOD 2.7v)
16.menu.clock.8MHz_external.upload.speed=115200
16.menu.clock.8MHz_external.bootloader.low_fuses=0xbf
16.menu.clock.8MHz_external.bootloader.high_fuses=0xdc
16.menu.clock.8MHz_external.bootloader.file=optiboot_flash/atmega16/optiboot_flash_atmega16_115200_8MHz.hex
16.menu.clock.8MHz_external.build.f_cpu=8000000L

#make atmega16 AVR_FREQ=8000000L BAUD_RATE=38400 UART=0 LED=B0 LED_START_FLASHES=2
16.menu.clock.8MHz_internal=8MHz internal    (BOD 2.7v)
16.menu.clock.8MHz_internal.upload.speed=38400
16.menu.clock.8MHz_internal.bootloader.low_fuses=0xa4
16.menu.clock.8MHz_internal.bootloader.high_fuses=0xdc
16.menu.clock.8MHz_internal.bootloader.file=optiboot_flash/atmega16/optiboot_flash_atmega16_38400_8MHz.hex
16.menu.clock.8MHz_internal.build.f_cpu=8000000L

#make atmega16 AVR_FREQ=1000000L BAUD_RATE=9600 UART=0 LED=B0 LED_START_FLASHES=2
16.menu.clock.1MHz_internal=1MHz internal    (BOD 2.7v)
16.menu.clock.1MHz_internal.upload.speed=9600
16.menu.clock.1MHz_internal.bootloader.low_fuses=0xa1
16.menu.clock.1MHz_internal.bootloader.high_fuses=0xdc
16.menu.clock.1MHz_internal.bootloader.file=optiboot_flash/atmega16/optiboot_flash_atmega16_9600_1MHz.hex
16.menu.clock.1MHz_internal.build.f_cpu=1000000L


############################################################


8535.name=ATmega8535
8535.upload.tool=avrdude
8535.upload.protocol=arduino
8535.upload.maximum_size=7680
8535.upload.maximum_data_size=512

8535.bootloader.tool=avrdudeCustom
8535.bootloader.unlock_bits=0x3f
8535.bootloader.lock_bits=0x0f

8535.build.mcu=atmega8535
8535.build.core=MightyCore
8535.build.board=AVR_ATmega8535

8535.menu.pinout.standard=Standard
8535.menu.pinout.standard.build.variant=standard
8535.menu.pinout.bobuino=Bobuino
8535.menu.pinout.bobuino.build.variant=bobuino

