MCUdude/MightyCore/avr/boards.txt
#make atmega8535 AVR_FREQ=16000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
8535.menu.clock.16MHz_external=16MHz external (BOD 2.7v)
8535.menu.clock.16MHz_external.upload.speed=115200
8535.menu.clock.16MHz_external.bootloader.low_fuses=0xbf
8535.menu.clock.16MHz_external.bootloader.high_fuses=0xdc
8535.menu.clock.16MHz_external.bootloader.file=optiboot_flash/atmega8535/optiboot_flash_atmega8535_115200_16MHz.hex
8535.menu.clock.16MHz_external.build.f_cpu=16000000L

#make atmega8535 AVR_FREQ=20000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
8535.menu.clock.20MHz_external=20MHz external (BOD 4.0v)
8535.menu.clock.20MHz_external.upload.speed=115200
8535.menu.clock.20MHz_external.bootloader.low_fuses=0x3f
8535.menu.clock.20MHz_external.bootloader.high_fuses=0xdc
8535.menu.clock.20MHz_external.bootloader.file=optiboot_flash/atmega8535/optiboot_flash_atmega8535_115200_20MHz.hex
8535.menu.clock.20MHz_external.build.f_cpu=20000000L

#make atmega8535 AVR_FREQ=8000000L BAUD_RATE=115200 UART=0 LED=B0 LED_START_FLASHES=2
8535.menu.clock.8MHz_external=8MHz external   (BOD 2.7v)
8535.menu.clock.8MHz_external.upload.speed=115200
8535.menu.clock.8MHz_external.bootloader.low_fuses=0xbf
8535.menu.clock.8MHz_external.bootloader.high_fuses=0xdc
8535.menu.clock.8MHz_external.bootloader.file=optiboot_flash/atmega8535/optiboot_flash_atmega8535_115200_8MHz.hex
8535.menu.clock.8MHz_external.build.f_cpu=8000000L

#make atmega8535 AVR_FREQ=8000000L BAUD_RATE=38400 UART=0 LED=B0 LED_START_FLASHES=2
8535.menu.clock.8MHz_internal=8MHz internal   (BOD 2.7v)
8535.menu.clock.8MHz_internal.upload.speed=38400
8535.menu.clock.8MHz_internal.bootloader.low_fuses=0xa4
8535.menu.clock.8MHz_internal.bootloader.high_fuses=0xdc
8535.menu.clock.8MHz_internal.bootloader.file=optiboot_flash/atmega8535/optiboot_flash_atmega8535_38400_8MHz.hex
8535.menu.clock.8MHz_internal.build.f_cpu=8000000L

#make atmega8535 AVR_FREQ=1000000L BAUD_RATE=9600 UART=0 LED=B0 LED_START_FLASHES=2
8535.menu.clock.1MHz_internal=1MHz internal   (BOD 2.7v)
8535.menu.clock.1MHz_internal.upload.speed=9600
8535.menu.clock.1MHz_internal.bootloader.low_fuses=0xa1
8535.menu.clock.1MHz_internal.bootloader.high_fuses=0xdc
8535.menu.clock.1MHz_internal.bootloader.file=optiboot_flash/atmega8535/optiboot_flash_atmega8535_9600_1MHz.hex
8535.menu.clock.1MHz_internal.build.f_cpu=1000000L
